export function isAdPost(text: string) {
  // Приводим текст к нижнему регистру для удобства проверки
  const lowerText = text.toLowerCase();

  // Ключевые слова, характерные для рекламы
  const adKeywords = [
    "акция",
    "розыгрыш",
    "чек",
    "скидк",
    "промокод",
    "загружайте",
    "получайте",
    "меняйте",
    "призы",
    "чеки",
    "купить",
    "заказать",
    "доставк",
    "магазин",
    "скидка",
    "распродажа",
    "специальное предложение",
    "только сегодня",
    "успей",
    "предложение ограничено",
    "промо",
    "бонус",
    "реклама",
    "скидочн",
    "распродаж",
    "заказ",
    "оплат",
    "доставк",
    "магазин",
    "онлайн",
    "интернет-магазин",
    "оферта",
    "условия акции",
    "правила акции",
    "incrypted",
    "подписат",
    "subscrib",
    "видео",
    "video",
    "vip",
    "вип",
    "подпи",
      "трансляц",
  "видео",
  "broadcast",
  "video",
    "sponsor",
    "спонсор"
  ];

  // Проверяем наличие ключевых слов
  const hasKeywords = adKeywords.some((keyword) => lowerText.includes(keyword));
  return hasKeywords;
}
